In [10]:
import numpy as np

import pandas as pd

In [11]:
dict1={
    "name":['harry','John','akshay','shubham'],
    "marks":[30,40,50,60],
    "city":['Gaya','Texas','Banaras','Bareilly']
}

In [12]:
dict1

{'name': ['harry', 'John', 'akshay', 'shubham'],
 'marks': [30, 40, 50, 60],
 'city': ['Gaya', 'Texas', 'Banaras', 'Bareilly']}

In [13]:
pd

In [29]:
x=pd.DataFrame(dict1)
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

# Q. What is pandas?
 * __Pandas is an open Sources data analysis library written in python.__
 * __It leverages the power and speed of numpy to make data analysis preprocessing easy for data scientiest.__
 * __It provides rich and highly robust data operations.__

# Pandas Data Structures

 * __Pandas has two types of data structure.__
 * __1. Series: It's one dimensional array with indexes, it store a single column or row of data in DataFrame.__
 * __2. DataFrame: It is tablular spreadsheet like structure representing rows each rows each of contains one or multiple columns.__

# Note:
 * __1. A One-Dimensional array(labeled) Capable of holding any type of data-Series.__
 * __2. A Two-Dimensional array(labeled) structures with columns of potentialally different types of data- DataFrame.__

In [25]:
ser=pd.Series(np.random.rand(40))

In [26]:
ser

0     0.380381
1     0.818919
2     0.168083
3     0.747152
4     0.974645
5     0.733715
6     0.188497
7     0.303235
8     0.572821
9     0.015894
10    0.604225
11    0.682259
12    0.565703
13    0.656910
14    0.813356
15    0.174386
16    0.448554
17    0.654932
18    0.159698
19    0.694148
20    0.318024
21    0.977636
22    0.416895
23    0.968285
24    0.336467
25    0.069136
26    0.105831
27    0.811564
28    0.350519
29    0.319603
30    0.749337
31    0.903288
32    0.699370
33    0.063605
34    0.401318
35    0.255258
36    0.363943
37    0.498175
38    0.468702
39    0.137506
dtype: float64

In [27]:
df

NameError: name 'df' is not defined

In [30]:
x

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

In [34]:
df=pd.DataFrame(dict1)

In [35]:
# CSV= comma seperated value file.

df.to_csv('sample.csv')

# Remove Index Value

In [36]:
df.to_csv('sample_index_False.csv',index=False)

In [37]:
df

      name  marks      city
0    harry     30      Gaya
1     John     40     Texas
2   akshay     50   Banaras
3  shubham     60  Bareilly

# head() function

In [43]:
df.head(2)   # name marks city ................................. .---------------,-------------,----------

    name  marks   city
0  harry     30   Gaya
1   John     40  Texas

# Describe() function

 * __For numeric data, the result's index will count, mean, std, min, max, as well as lower, 50 and upper percentiles. By default the lower percentile is 25 and the uppper percentile is 75. The 50 Percentile is the same as the median.__

In [44]:
df.describe()

           marks
count   4.000000
mean   45.000000
std    12.909944
min    30.000000
25%    37.500000
50%    45.000000
75%    52.500000
max    60.000000